zupcorp23012025.Расширение1/src/Documents/ЗГ_ВводУдержанийСотрудников/ЗГ_ВводУдержанийСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗГ_ВводУдержанийСотрудников</name>
  <registerRecords>AccumulationRegister.ЗГ_УдержанияСотрудниковОрганизации</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Уволен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/ЗГ_ВводУдержанийСотрудников/Forms/ФормаЗаполнения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Параметры.Подразделение;
	ПериодРегистрации = Параметры.ПериодРегистрации;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаПоУмолчанию", СуммаПоУмолчанию);
	СтруктураВозврата.Вставить("ДанныеВременногоХранилища", ПолучитьДанныеЗаполнения());	
	ОповеститьОВыборе(СтруктураВозврата);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаполнения()
	
	Результат = Документы.ЗГ_ВводУдержанийСотрудников.ПолучитьРезультатЗапросаФизическихЛицДляЗаполнения(Подразделение, ПериодРегистрации, Должность);
	
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для заполнения!");
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Результат.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура КнопкаОтмены(Команда)
	Закрыть();
КонецПроцедуры
